In [10]:
import pandas as pd

In [11]:
def flatten(df, col):
    return df.explode(column, ignore_index=True)

In [12]:
df = pd.DataFrame(data=[[[1, 2],5], [['a', 'b', 'c'], 6], [77, 3]], columns=list('AB'))
column = 'A'
df_out = pd.DataFrame(data=[[1, 5], [2, 5], ['a', 6], ['b', 6], ['c', 6], [77, 3]], columns=list('AB'))
df_user = flatten(df, column)

In [13]:
df

           A  B
0     [1, 2]  5
1  [a, b, c]  6
2         77  3

In [14]:
df_user

    A  B
0   1  5
1   2  5
2   a  6
3   b  6
4   c  6
5  77  3